---
kind: method
id: M:Autodesk.Revit.DB.ViewSet.Clear
source: html/1f3fb73d-68ae-eb2e-7de2-7e73b291b861.htm
---
# Autodesk.Revit.DB.ViewSet.Clear Method

Removes every view from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```